Updated aws project
